{
    "format": "layers-model",
    "generatedBy": "keras v2.4.0",
    "convertedBy": "TensorFlow.js Converter v3.3.0",
    "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [{
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 64],
                        "dtype": "float32",
                        "sparse": false,
                        "ragged": false,
                        "name": "embedding_input"
                    }
                }, {
                    "class_name": "Embedding",
                    "config": {
                        "name": "embedding",
                        "trainable": true,
                        "batch_input_shape": [null, 64],
                        "dtype": "float32",
                        "input_dim": 10000,
                        "output_dim": 1000,
                        "embeddings_initializer": {
                            "class_name": "RandomUniform",
                            "config": {
                                "minval": -0.05,
                                "maxval": 0.05,
                                "seed": null
                            }
                        },
                        "embeddings_regularizer": null,
                        "activity_regularizer": null,
                        "embeddings_constraint": null,
                        "mask_zero": false,
                        "input_length": 64
                    }
                }, {
                    "class_name": "Conv1D",
                    "config": {
                        "name": "conv1d",
                        "trainable": true,
                        "batch_input_shape": [null, null, 1],
                        "dtype": "float32",
                        "filters": 64,
                        "kernel_size": [5],
                        "strides": [1],
                        "padding": "causal",
                        "data_format": "channels_last",
                        "dilation_rate": [1],
                        "groups": 1,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "MaxPooling1D",
                    "config": {
                        "name": "max_pooling1d",
                        "trainable": true,
                        "dtype": "float32",
                        "strides": [2],
                        "pool_size": [2],
                        "padding": "valid",
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "GlobalAveragePooling1D",
                    "config": {
                        "name": "global_average_pooling1d",
                        "trainable": true,
                        "dtype": "float32",
                        "data_format": "channels_last"
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 24,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }, {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "trainable": true,
                        "dtype": "float32",
                        "units": 5,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "GlorotUniform",
                            "config": {
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null
                    }
                }]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [{
                    "class_name": "MeanMetricWrapper",
                    "config": {
                        "name": "accuracy",
                        "dtype": "float32",
                        "fn": "categorical_accuracy"
                    }
                }]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "Adam",
                    "learning_rate": 0.0010000000474974513,
                    "decay": 0.0,
                    "beta_1": 0.8999999761581421,
                    "beta_2": 0.9990000128746033,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"],
        "weights": [{
            "name": "conv1d/kernel",
            "shape": [5, 1000, 64],
            "dtype": "float32"
        }, {
            "name": "conv1d/bias",
            "shape": [64],
            "dtype": "float32"
        }, {
            "name": "dense/kernel",
            "shape": [64, 24],
            "dtype": "float32"
        }, {
            "name": "dense/bias",
            "shape": [24],
            "dtype": "float32"
        }, {
            "name": "dense_1/kernel",
            "shape": [24, 5],
            "dtype": "float32"
        }, {
            "name": "dense_1/bias",
            "shape": [5],
            "dtype": "float32"
        }, {
            "name": "embedding/embeddings",
            "shape": [10000, 1000],
            "dtype": "float32"
        }]
    }]
}